Revit 2027 API
MEPNetworkSegmentData.IsCriticalPath Property
 Verifies if the segment is on the critical path.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCriticalPath { get; }
Public ReadOnly Property IsCriticalPath As Boolean
	Get
public:
property bool IsCriticalPath {
	bool get ();
}
member IsCriticalPath : bool with get
Property Value
Boolean
See Also
Reference
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace